In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
df=pd.read_csv('AcademicPerformance.csv')

In [5]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,Year_Birth,math score,reading score,writing score,Dt_Admission,College_Fees
0,female,group B,bachelor's degree,standard,none,1970,72.0,72,74,6/16/14,"$84,835.00"
1,female,group C,some college,standard,completed,1961,NaN,na,A,6/15/14,"$57,091.00"
2,female,group B,master's degree,standard,none,1958,90.0,95,93,5/13/14,"$67,267.00"
3,male,group A,associate's degree,free/reduced,none,1967,NaN,NaN,44,05-11-2014,"$32,474.00"
4,male,group C,some college,standard,none,1989,76.0,78,75,04-08-2014,"$21,474.00"
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,1972,88.0,99,95,8/24/12,"$57,107.00"
996,male,group C,high school,free/reduced,none,1972,62.0,55,55,8/17/12,"$76,467.00"
997,female,group C,high school,free/reduced,completed,1972,59.0,71,65,5/27/14,"$76,467.01"
998,female,group D,some college,standard,completed,1972,68.0,78,77,2/23/14,"$51,315.00"
999,female,group D,some college,free/reduced,none,1972,77.0,86,86,01-10-2014,"$43,602.00"

In [8]:
df['math score'].isnull().sum()

np.int64(2)

In [9]:
missing_values=['n/a','na','--']

In [10]:
df['reading score']

0       72
1       na
2       95
3      NaN
4       78
      ...
995     99
996     55
997     71
998     78
999     86
Name: reading score, Length: 1000, dtype: object

In [11]:
df=pd.read_csv('AcademicPerformance.csv',na_values=missing_values)

In [12]:
df['reading score']

0      72.0
1       NaN
2      95.0
3       NaN
4      78.0
       ...
995    99.0
996    55.0
997    71.0
998    78.0
999    86.0
Name: reading score, Length: 1000, dtype: float64

In [13]:
from datetime import date

In [14]:
df['age']=date.today().year-df['Year_Birth']

In [15]:
df['year']=pd.DatetimeIndex(df['Dt_Admission']).year

In [16]:
df['EL']=date.today().year-df['year']

In [17]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,Year_Birth,math score,reading score,writing score,Dt_Admission,College_Fees,age,year,EL
0,female,group B,bachelor's degree,standard,none,1970,72.0,72.0,74,6/16/14,"$84,835.00",55,2014,11
1,female,group C,some college,standard,completed,1961,NaN,NaN,A,6/15/14,"$57,091.00",64,2014,11
2,female,group B,master's degree,standard,none,1958,90.0,95.0,93,5/13/14,"$67,267.00",67,2014,11
3,male,group A,associate's degree,free/reduced,none,1967,NaN,NaN,44,05-11-2014,"$32,474.00",58,2014,11
4,male,group C,some college,standard,none,1989,76.0,78.0,75,04-08-2014,"$21,474.00",36,2014,11

In [18]:
df['Fees']=df['College_Fees'].str.replace(',','').str.replace('$','').str.replace('.','').fillna(0).astype(int)

In [19]:
df['Fees_Million']=df['Fees'].apply(lambda x:round(x/1000000))

In [20]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,Year_Birth,math score,reading score,writing score,Dt_Admission,College_Fees,age,year,EL,Fees,Fees_Million
0,female,group B,bachelor's degree,standard,none,1970,72.0,72.0,74,6/16/14,"$84,835.00",55,2014,11,8483500,8
1,female,group C,some college,standard,completed,1961,NaN,NaN,A,6/15/14,"$57,091.00",64,2014,11,5709100,6
2,female,group B,master's degree,standard,none,1958,90.0,95.0,93,5/13/14,"$67,267.00",67,2014,11,6726700,7
3,male,group A,associate's degree,free/reduced,none,1967,NaN,NaN,44,05-11-2014,"$32,474.00",58,2014,11,3247400,3
4,male,group C,some college,standard,none,1989,76.0,78.0,75,04-08-2014,"$21,474.00",36,2014,11,2147400,2

In [21]:
dataset=[11,41,20,3,101,55,68,97,99,6]

In [22]:
sorted(dataset)

[3, 6, 11, 20, 41, 55, 68, 97, 99, 101]

In [23]:
quantile1,quantile3=np.percentile(dataset,[25,75])
print("quantile1:",quantile1," ","quantile3:",quantile3)

quantile1: 13.25   quantile3: 89.75

In [25]:
iqr_value=quantile3-quantile1
print("iqr_value:",iqr_value)

iqr_value: 76.5

In [26]:
lower_bound=quantile1-(1.5*iqr_value)
upper_bound=quantile3+(1.5*iqr_value)
print("lower bound:",lower_bound," ","upper bound:",upper_bound)

lower bound: -101.5   upper bound: 204.5